using System;
using System.Collections.Generic;
using System.Text;

namespace CourseApp
{
    public class Refrigerator : Appliances
    {
        private double temperature;

        public Refrigerator()
            : base()
        {
            Temperature = 3;
        }

        public Refrigerator(int temp)
            : base()
        {
            Temperature = temp;
        }

        public Refrigerator(int temp, int md, int ag)
            : base(md, ag)
        {
            Temperature = temp;
        }

        public double Temperature
        {
            get
            {
                return temperature;
            }

            set
            {
                if (value <= 0)
                {
                    temperature = 0;
                }
                else if (value >= 10)
                {
                    temperature = 10;
                }
                else
                {
                    temperature = value;
                }
            }
        }

        public override string Status()
        {
            return "\nХолодильник включён";
        }

        public override string Art()
        {
            if (Model == 1)
            {
                return $@"
Температура в холодильнике: {Temperature}, Модель холодильника {Model}, Возраст холодильника: {Age}. 
       ___________,_____
      |     |  #  |=====|
      |     | (_) |=====|
      |> _  |_____|=====|
      | [_] |     |     |
      |     |_____|=====|
      |     |     |_____|
      |   ] |_____|     |
      |     |_____|=====|
      |     | ___ |_____|
      |>    |[___]|     |
      |     |[___]|=====|
      |_____|=====|_____|";
            }
            else
            {
                return $@"
Температура в холодильнике: {Temperature}, Модель холодильника {Model}, Возраст холодильника: {Age}. 

      (∩∩│││┤┤╠╠╠║║║╢▒╢╢╢▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒
      ((∩∩││┤Ñ╠╠╠╠║║╢▒╢╢╢▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒
      '(∩∩││┤Ñ╠╠╠╠║║╢▒╢▒╢▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒
      :(∩∩││┤Ñ╠╠╠╠║║╢▒╢╢╢▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒
      :(∩∩││┤┤╠╠╠║║(╫▒│▒▒╢▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒
      ::∩∩││┤┤╠╠╠║║ ╫▒(▓▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒
      :((∩││┤┤╠╠╠╠╠ ╫▌(█▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒
      '(∩∩│││┤╠╠╠╠╠ █▌(█▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒
       ((∩││┤┤╠╠╠╠╠ █▌(█▓▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒
       '╔╔││┤┤╙╙╙╚╠ ╫▌(█▓▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒
       :Ñ╠ÑN╠╠Ñ┤ÑÑ╠ ▒▌(█▓▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒
       :▓▓▓▓▓▓▓▓▒▓▒ ▒▓(█▓▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒
       :▒▓▒╠╙Ñ╙▒∩║Ñ ▒▓j█▓▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒
       :▒▒▒│∩└└▐,ÑÑ ▓█j█▓▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒
       :▒▒∩'::∩⌠∩│▐ ▓█j█▓▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒
       :▒▒ ::(∩∩∩ ▐ ▓█j█▓▒▒▒▒▒▒▒▒▒▒▒▒▓▒▒▒▒
       :╙Ñ∩NNNN##M╢ █▌j██▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒
       ((∩│││┤Ñ╠╠╠╠ █▌j█▓▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒
       :(∩│││┤Ñ╠╠╠╠ █▌j█▓▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒
       :(∩│││┤╠╠╠╠╠ █▌j█▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒
       '(∩│││┤╠╠╠║║ █▌j█▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒
       ((∩│││┤╠╠╠║║j█▌j▓▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒
       ((∩││┤┤╠╠╠╠║j▓▌⌠▓▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒
       ((∩││┤┤╠╠╠╠║▒▒▒▒╢▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒
       (∩│││┤┤╠╠╠╠║║╢▒╢╢╢╢▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒
       (∩∩││┤┤╠╠╠╠║║╢▌╢╢╢▒╢▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒
      :(∩∩││┤Ñ╠╠╠╠║║╢▌║╢╢╢╢▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒
      ::∩│││┤Ñ╠╠╠╠║║╢▌║╢╢╢╢▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒
      (∩│││┤┤╠╠╠╠╠╠║╢▌║╢╢╢╢▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒
      (∩│││┤Ñ╠╠╠╠╠║║╢▌╢╢╢╢╢▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒
      ╓▄▄QQ╡ÑÑ╠║║║▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒
      ▒███████████████████████████████████
       └                                └";
            }
        }

        public override void GetInfo()
        {
            Console.WriteLine(Status());
            Console.WriteLine(Art());
        }
    }
}