using System;
using System.Collections.Generic;
using System.Linq;
using System.Text;
using System.Threading.Tasks;

namespace CourseApp
{
    public class Ship : Transport
    {
        private int vodoizmeschenie;

        public Ship()
            : base()
        {
            Passangers = 20;
            Dlina = 55;
            Vodoizmeschenie = 100;
        }

        public Ship(int dlina)
        {
            Passangers = 25;
            Dlina = dlina;
            Vodoizmeschenie = 100;
        }

        public Ship(int passangers, int dlina, int vodoizmeschenie)
        {
            Passangers = passangers;
            Dlina = dlina;
            Vodoizmeschenie = vodoizmeschenie;
        }

        public int Vodoizmeschenie
        {
            get
            {
                return vodoizmeschenie;
            }

            set
            {
                if (value > 2000 || value < 10)
                {
                    Console.WriteLine("Невозможное водоизмещение корабля(min:10 max:2000)");
                    throw new Exception();
                }
                else
                {
                    vodoizmeschenie = value;
                }
            }
        }

        public override void Info()
        {
            Console.WriteLine($"Корабль: пассажиров:{Passangers} длина:{Dlina} водоизмещение:{Vodoizmeschenie}");
            Console.WriteLine(Predlojenie());
            Console.WriteLine(Ris());
        }

        public override string ToString()
        {
            return $"Корабль с длиной {Dlina}  громко гудит";
        }

        public override string Predlojenie()
        {
            return $"Корабль с длиной {Dlina} метров вышел в открытое море";
        }

        public string Ris()
        {
            return @"_¶¶¶
_____________________¶
_____________________¶¶¶¶¶¶¶¶¶¶¶¶¶
_____________________¶¶¶___¶__¶_¶¶¶¶
_____________________¶¶¶___¶¶¶¶___¶¶
_____________________¶¶¶__¶¶¶¶¶___¶¶
_____________________¶¶¶__¶¶¶¶¶___¶
_____________________¶¶¶¶¶¶__¶¶___¶
_____________________¶_________¶¶¶¶
_____________¶¶¶¶¶¶¶¶¶¶¶¶¶
_____________¶¶___________¶¶
______________¶____________¶
______________¶_____________¶
_______________¶____________¶
_______________¶____________¶_¶¶
_______________¶__¶¶¶¶¶¶¶¶¶¶¶¶¶¶¶
_____¶¶¶¶¶¶¶¶¶¶¶¶¶¶______________¶
_____¶____________¶¶_____________¶¶____¶
_____¶¶____________¶_____¶¶¶¶¶¶¶¶¶¶¶¶¶¶¶¶
______¶______¶¶¶¶¶¶¶¶¶¶¶¶¶¶______________¶
______¶¶_____¶¶___________¶______________¶¶
_______¶______¶____________¶______________¶
_______¶______¶¶___________¶_____________¶¶
_______¶_______¶___________¶_____________¶¶
______¶¶_______¶___________¶¶____________¶
______¶¶¶¶¶¶¶¶¶¶¶__________¶¶___________¶¶
___________¶_¶_¶¶________¶¶¶_____¶¶¶¶¶¶¶¶_____¶¶¶
___________¶_¶_¶¶¶¶¶¶¶¶¶¶¶_¶¶¶¶¶¶¶_______¶¶¶¶¶__¶¶
¶¶¶¶¶¶_____¶_¶______¶¶_¶_______¶_¶¶¶¶¶¶¶¶¶___¶¶¶¶¶
¶¶___¶¶¶¶¶¶¶¶¶______¶¶_¶____¶¶¶¶¶¶¶________¶¶
__¶¶________¶¶¶¶¶¶¶¶¶¶¶¶¶¶¶¶¶¶____¶¶______¶
____¶____________________________¶¶_¶____¶
_____¶_____¶¶¶_____¶¶_____¶¶¶_____¶¶¶___¶¶
______¶___¶¶_¶¶___¶¶_¶____¶_¶¶__________¶
______¶¶____¶¶_____¶¶¶_____¶¶__________¶¶
_______¶¶_____________________________¶¶
________¶¶___________________________¶¶
_________¶¶________________________¶¶¶
___________¶¶¶¶¶¶¶¶¶¶¶¶¶¶¶¶¶¶¶¶¶¶¶¶¶
";
        }
    }
}
