using System;

namespace CourseApp
{
    public class Television
    {
        public int Channel { get; set; }
        public int Model { get; set; }
        public byte Age { get; set; }
        public byte check;
        public Television() { Channel = 1; Model = 1; Age = 0; }
        public Television(int channel)
        {
            Channel = channel;
            if (channel < 0) { Console.WriteLine("Канал должен быть >= 0"); }
            else{
                if (channel >= 100)
                {
                    Model = 1; Age = 3;
                }
                else
                {
                    Model = 2; Age = 7;
                }
            } }
        public Television(int channel, int model, byte age)
        {
            Channel = channel;
            Model = model;
            Age = age;
            if (channel < 0)
            {
                Console.WriteLine("\nКанал должен быть >= 0");
                check += 1;
            }
                if (model != 1 && model != 2)
            {
                Console.WriteLine("\nМодель телевизора должна быть 1 или 2");
                check += 1;
            }
            if (age > 15)
            {
                Console.WriteLine("\nВозраст телевизора должен находиться в промежутке от 0 до 15");
                check += 1; 
            }

        }
        public string GetInfo()
        {
            string h = "";
            for (int i = 0; i < 3 - Channel.ToString().Length; i++) h += (Model == 1) ? "▒" : "░";
            if (check == 0)
            {
                if (Model == 1) return ($"\nКанал: {Channel}, Модель телевизора: {Model}, Возвраст телевизора: {Age}\n ▄██████████████████████████████████████▄\n █▀─▄▄▄▄▄▄▄▄▄▄▄▄▄▄▄▄▄▄▄▄▄▄▄▄▄▄▄─▀████████\n █▐▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▌███░░███\n █▐▒▒Канал {Channel}{h}▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▌█░░██░░█\n █▐▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▌███░░███\n █▐▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▌████████\n █▐▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▌███░░███\n █▐▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▌█░░██░░█\n █▐▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▌███░░███\n █▐▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▌████████\n █▐▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▌████████\n █▐▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▌████████\n █▄─▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀─▄████████\n ▀██████████████████████████████████████▀\n ───▄▄▄████████████████████████████▄▄▄\n ──████████████████████████████████████");
                else return ($"\nКанал: {Channel}, Модель телевизора: {Model}, Возвраст телевизора: {Age}\n ██████████░▀▀██████████████▀▀░██████████\n ████████████▄░▀▀████████▀▀░▄████████████\n ███████████████▄█▀▀▀▀▀▀█▄███████████████\n ████████████████▄▄▄▄▄▄▄▄████████████████\n ████▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀████\n ███░░▄▄█████████████████████▄░░░▄▄░░░███\n ███░░█▀░Канал {Channel}{h}▄▄▄▄█████████░████░░███\n ███░░█░░░░░░░▄████████████████░░▀▀░░░███\n ███░░█░░░░▄███████████████████░░░░░░░███\n ███░░█░░░█████████████████████░░░░░░░███\n ███░░█░░██████████████████████░░░░░░░███\n ███░░█░███████████████████████░▀███░░███\n ███░░█████████████████████████░▄▄▄▄░░███\n ███░░█████████████████████████░▄▄▄▄░░███\n ███░░▀███████████████████████▀░░▀▀▀░░███\n ███▄░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░▄███\n ████████████████████████████████████████");
            }
            else return ("");
        }
    }
}
